#coding:utf-8
import time

x = {'0' :'0','a': ']', 'z': '>', 'e': '<', 'r': '¤', 't': '@',
'y': '^', 'u': '\\\\', 'i': '`', 'o': '|', 'p': '[', 'q': '}',
's': '{', 'd': '#', 'f': 'à', 'g': 'ç', 'h': '_', 'j': 'è',
'k': '-', ' ': ')', 'l': '(', 'm': "'", 'w': '"', 'x': 'é',
'c': '&', 'v': 'µ', 'b': '%', 'n': '£', '1': '¨', '2': '$',
'3': '^', '4': '*', '5': 'ù', '6': '§', '7': '/', '8': '.',
'9': '?', 'A': 'N', 'Z': 'B', 'E': 'V', 'R': 'C', 'T': 'X',
'Y': 'W', 'U': 'M', 'I': 'L', 'O': 'K', 'P': 'J', 'Q': 'H',
'S': 'G', 'D': 'F', 'F': 'D', 'G': 'S', 'H': 'Q', 'J': 'P',
'K': 'O', 'L': 'I', 'M': 'U', 'W': 'Y', 'X': 'T', 'C': 'R',
'V': 'E', 'B': 'Z', 'N': 'A', '?': '9', '.': '8', '/': '7',
'§': '6', 'ù': '5', '*': '4', '^': 'y', '$': '2', '¨': '1',
'£': 'n', '%': 'b', 'µ': 'v', '&': 'c', 'é': 'x', '"': 'w',
"'": 'm', '(': 'l', ')': ' ', '-': 'k', 'è': 'j', '_': 'h',
'ç': 'g', 'à': 'f', '#': 'd', '{': 's', '}': 'q', '[': 'p',
'|': 'o', '`': 'i', '\\': 'u', '@': 't', '¤': 'r', '<': 'e',
'>': 'z', ']':'a', '!':'!'}

'''def printer(_self):
	r = ""
	for i in range(len(_self)):
		time.sleep(0.10)
		r += _self[i]
		print(r)'''

from math import exp
def d___cryptage(_self):
	_chr = ""
	for xt in range(len(_self)):
		if _self[xt] in x:
			_chr += x[_self[xt]]
	return _chr



def afficher(texte, delai = 0.10):
    for i in texte:
        print(i, end="")
        time.sleep(delai)

print(d___cryptage("Px{\\{)<{@)(<)C|`)#<{)¤|`{!!!!"))

